# SetTextStyleByClass

## Description
SetTextStyleByClass sets the referenced object to use the class text style.  To undo this, use SetTextStyleRef on the object.

```pascal
PROCEDURE SetTextStyleByClass(objectId : HANDLE);
```

```python

def vs.SetTextStyleByClass(objectId):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectId|HANDLE|handle to object|

## See Also
VS Functions:
SetTextStyleRef| GetTextStyleRef| SetTextStyleRefN| GetTextStyleRefN| SetTextStyleByClass| SetTextStyleByClassN| IsTextStyleByClass| IsTextStyleByClassN

## Version
Availability: from Vectorworks 2015
## Category
* Object Attributes